<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/3_Ranking.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Ranking Functions

## Overview

### ü•Ö Analysis Goals

Explore user-level metrics to understand customer value, order quantity, and cohort rankings.

- **Average LTV by Customer:** Aggregate total revenue per customer and calculate the average lifetime value for each customer. Provides insights into the long-term value of users and their contributions to the business.
- **Rank Customers by Order Quantity:** Calculate and rank customers based on their total order quantity. Helps identify the most engaged customers and their purchasing behavior.
- **Monthly Ranking of Orders by Cohort:** Rank monthly orders within each cohort to evaluate trends and performance over time. Offers insights into order distribution and growth patterns across cohorts.

### üìò Concepts Covered

- `ORDER BY`
- Ranking
    - `ROW_NUMBER`
    - `RANK`
    - `DENSE_RANK`

In [1]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## ORDER BY

### üìù¬†Notes

`ORDER BY`

- **ORDER BY**: Orders rows within each partition for the function.
- `ORDER BY` can be ordered in either `DESC` or `ASC` order.
- Syntax
    ```sql
    SELECT
        window_function() OVER (
            PARTITION BY partition_expression
            ORDER BY column_name --DESC or ASC
        ) AS window_column_alias
    FROM table_name;
    ```

#### Importance of `ORDER BY` in a Window Function  

1. Controls Row Processing Order üèõÔ∏è
    - Defines how rows are sequentially evaluated within their partition.
    - Essential for functions like cumulative sums, moving averages, and rankings.  
2. Required for Certain Window Functions ü™ü
    - Functions like `ROW_NUMBER()`, `RANK()`, `DENSE_RANK()`, and `LAG()/LEAD()` require an `ORDER BY` inside `OVER()` to determine sequence.  
3. Affects Aggregation Window üìä
    - For cumulative functions (`SUM()`, `AVG()`, etc.), it determines how values are accumulated row by row.

#### Running Total of Orders for Customers

In [2]:
%%sql

SELECT 
    customerkey,
    orderdate,
    (quantity * netprice * exchangerate) AS net_revenue,
    COUNT(*) OVER (
        PARTITION BY customerkey 
        ORDER BY orderdate
    ) AS running_order_count
FROM sales
LIMIT 15

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

15 rows affected.

    customerkey   orderdate  net_revenue  running_order_count
0            15  2021-03-08      2217.41                    1
1           180  2018-07-28       525.31                    1
2           180  2023-08-28      1913.55                    3
3           180  2023-08-28        71.36                    3
4           185  2019-06-01      1395.52                    1
5           243  2016-05-19       287.67                    1
6           387  2018-12-21        45.62                    4
7           387  2018-12-21        97.05                    4
8           387  2018-12-21      1608.10                    4
9           387  2018-12-21       619.77                    4
10          387  2021-10-30      1265.56                    5
11          387  2023-11-16       446.44                    9
12          387  2023-11-16        30.51                    9
13          387  2023-11-16       362.44                    9
14          387  2023-11-16       180.35                    9

#### Running Average Net Revenue for Customer

In [3]:
%%sql

SELECT 
    customerkey,
    orderdate,
    (quantity * netprice * exchangerate) AS net_revenue,
    AVG(quantity * netprice * exchangerate) OVER (
        PARTITION BY customerkey 
        ORDER BY orderdate
    ) AS running_avg_revenue
FROM sales
LIMIT 15

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

15 rows affected.

    customerkey   orderdate  net_revenue  running_avg_revenue
0            15  2021-03-08      2217.41              2217.41
1           180  2018-07-28       525.31               525.31
2           180  2023-08-28      1913.55               836.74
3           180  2023-08-28        71.36               836.74
4           185  2019-06-01      1395.52              1395.52
5           243  2016-05-19       287.67               287.67
6           387  2018-12-21      1608.10               592.64
7           387  2018-12-21       619.77               592.64
8           387  2018-12-21        45.62               592.64
9           387  2018-12-21        97.05               592.64
10          387  2021-10-30      1265.56               727.22
11          387  2023-11-16        30.51               517.32
12          387  2023-11-16       446.44               517.32
13          387  2023-11-16       180.35               517.32
14          387  2023-11-16       362.44               517.32

#### Average LTV by Customer

**`ORDER BY`**

1. Get the average revenue by each customer (similar to the last query from our previous example, except the CTE `cohort_summary` becomes our main query).  
   - Define a CTE `cohort_analysis` to calculate the cohort year and total revenue for each customer.  
        - Extract the cohort year using `EXTRACT(YEAR FROM MIN(orderdate))`.  
        - Calculate the total revenue for each customer with `SUM(quantity * netprice * exchangerate)`.  
        - Group by `customerkey` to ensure total revenue and cohort year are assigned to each customer.  
   - In the main query: 
        - üîî Use `AVG(total_customer_net_revenue) OVER (PARTITION BY cohort_year ORDER BY total_customer_net_revenue)` to calculate the average revenue per customer for each cohort and order by the customer's net revenue.  
        - Select `cohort_year`, `customerkey`, `total_customer_net_revenue` (rename this to `customer_ltv`) and the average total revenue for output.

In [4]:
%%sql

WITH yearly_cohort AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        SUM(quantity * netprice * exchangerate) AS customer_ltv 
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    cohort_year,
    customerkey,
    customer_ltv,
    AVG(customer_ltv) OVER (PARTITION BY cohort_year ORDER BY customer_ltv) AS avg_cohort_ltv --Updated
FROM yearly_cohort
-- ORDER BY
--     cohort_year,
--     customerkey
-- ORDER BY commented out

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  customer_ltv  avg_cohort_ltv
0            2015      1035383          3.14            3.14
1            2015       980553          4.66            3.90
2            2015      1727718          4.89            4.23
3            2015      1967829          5.53            4.56
4            2015       227582          5.86            4.82
...           ...          ...           ...             ...
49482        2024       556313      17556.50         1983.58
49483        2024       494202      20000.34         1996.46
49484        2024      1707989      20094.80         2009.38
49485        2024       446428      20924.83         2022.89
49486        2024      1557543      22586.83         2037.55

[49487 rows x 4 columns]

<img src="../Resources/images/3.3_customer_avg_ltv.png" alt="Continent" width="50%">

> ‚ö†Ô∏è **Chart Note**: This plots only 15 of our customers for better visualization.

---
## ROW_NUMBER

### üìù¬†Notes

`ROW_NUMBER`

- **ROW NUMBER**: Assigns a unique number to each row within a partition.
- Syntax:
    ```sql
    ROW_NUMBER() OVER(
         PARTITION BY partition_expression
         ORDER BY column_name
    ) AS window_column_alias
    ```

### üîë Key Concepts
- **üìä Business Terms**: 
  - Customer Order Rank: Unique position assigned to each customer based on their order metrics
  - Sequential Numbering: Process of assigning unique, consecutive numbers to orders or customers
  - Order Frequency: How often a customer makes purchases over a given time period
- **üí° Why It Matters**: Assigns unique identifiers to orders, enabling customer behavior analysis
- **üéØ Common Use Cases**: Customer order tracking, monthly cohort rankings
- **üìà Related KPIs**: Order frequency, customer engagement metrics


### üìà Analysis

- Rank customers by their total amount of orders.
- Track customer ordering behavior over time, grouping by the year of first purchase (cohort year) and aggregating orders and unique users by month.

#### Assign Row Numbers Without ORDER BY (DEMO ONLY)

1. Assign a row number to each row in the sales table.
   - Use ROW_NUMBER() without any ORDER BY clause.
      - ‚ö†Ô∏è This will assign arbitrary numbers that may change between query runs.
   - Not recommended as it provides no meaningful sequence.

In [5]:
%%sql

SELECT 
    ROW_NUMBER() OVER(),
    *
FROM sales
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,row_number,orderkey,linenumber,orderdate,deliverydate,customerkey,storekey,productkey,quantity,unitprice,netprice,unitcost,currencycode,exchangerate
0,1,1000,0,2015-01-01,2015-01-01,947009,400,48,1,112.46,98.97,57.34,GBP,0.64
1,2,1000,1,2015-01-01,2015-01-01,947009,400,460,1,749.75,659.78,382.25,GBP,0.64
2,3,1001,0,2015-01-01,2015-01-01,1772036,430,1730,2,54.38,54.38,25.00,USD,1.00
3,4,1002,0,2015-01-01,2015-01-01,1518349,660,955,4,315.04,286.69,144.88,USD,1.00
4,5,1002,1,2015-01-01,2015-01-01,1518349,660,62,7,135.75,135.75,62.43,USD,1.00
5,6,1002,2,2015-01-01,2015-01-01,1518349,660,1050,3,499.20,434.30,229.57,USD,1.00
6,7,1002,3,2015-01-01,2015-01-01,1518349,660,1608,1,65.99,58.73,33.65,USD,1.00
7,8,1003,0,2015-01-01,2015-01-01,1317097,510,85,3,74.99,74.99,34.48,USD,1.00
8,9,1004,0,2015-01-01,2015-01-01,254117,80,128,2,114.72,113.57,58.49,CAD,1.16
9,10,1004,1,2015-01-01,2015-01-01,254117,80,2079,1,499.45,499.45,165.48,CAD,1.16

#### Assign Row Numbers With ORDER BY

1. Assign a row number to each row in the sales table.
   - Use `ROW_NUMBER()` with `ORDER BY orderdate, orderkey, linenumber`.
      - ‚úÖ This will assign consistent numbers based on chronological order.
   - Provides meaningful sequence based on order date and line items.

In [6]:
%%sql

SELECT
    ROW_NUMBER() OVER(
        ORDER BY 
            orderdate,
            orderkey,
            linenumber
    ) AS row_num,
    *
FROM sales
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,row_num,orderkey,linenumber,orderdate,deliverydate,customerkey,storekey,productkey,quantity,unitprice,netprice,unitcost,currencycode,exchangerate
0,1,1000,0,2015-01-01,2015-01-01,947009,400,48,1,112.46,98.97,57.34,GBP,0.64
1,2,1000,1,2015-01-01,2015-01-01,947009,400,460,1,749.75,659.78,382.25,GBP,0.64
2,3,1001,0,2015-01-01,2015-01-01,1772036,430,1730,2,54.38,54.38,25.00,USD,1.00
3,4,1002,0,2015-01-01,2015-01-01,1518349,660,955,4,315.04,286.69,144.88,USD,1.00
4,5,1002,1,2015-01-01,2015-01-01,1518349,660,62,7,135.75,135.75,62.43,USD,1.00
5,6,1002,2,2015-01-01,2015-01-01,1518349,660,1050,3,499.20,434.30,229.57,USD,1.00
6,7,1002,3,2015-01-01,2015-01-01,1518349,660,1608,1,65.99,58.73,33.65,USD,1.00
7,8,1003,0,2015-01-01,2015-01-01,1317097,510,85,3,74.99,74.99,34.48,USD,1.00
8,9,1004,0,2015-01-01,2015-01-01,254117,80,128,2,114.72,113.57,58.49,CAD,1.16
9,10,1004,1,2015-01-01,2015-01-01,254117,80,2079,1,499.45,499.45,165.48,CAD,1.16

> **NOTE:** We can use `DESC` to specify the order of rankings.

In [7]:
%%sql

SELECT
    ROW_NUMBER() OVER(
        ORDER BY 
            orderdate DESC,
            orderkey DESC,
            linenumber DESC
    ) AS row_num,
    *
FROM sales
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,row_num,orderkey,linenumber,orderdate,deliverydate,customerkey,storekey,productkey,quantity,unitprice,netprice,unitcost,currencycode,exchangerate
0,1,3398035,2,2024-04-20,2024-04-22,267690,999999,1693,6,6.88,6.88,3.16,CAD,1.38
1,2,3398035,1,2024-04-20,2024-04-22,267690,999999,415,5,326.00,293.40,166.20,CAD,1.38
2,3,3398035,0,2024-04-20,2024-04-22,267690,999999,1575,2,60.99,53.67,28.05,CAD,1.38
3,4,3398034,2,2024-04-20,2024-04-21,664396,999999,1646,1,159.99,159.99,73.57,EUR,0.94
4,5,3398034,1,2024-04-20,2024-04-21,664396,999999,1651,7,159.99,139.19,73.57,EUR,0.94
5,6,3398034,0,2024-04-20,2024-04-21,664396,999999,1511,1,229.00,199.23,105.31,EUR,0.94
6,7,3398033,2,2024-04-20,2024-04-20,635184,160,1206,3,1560.00,1388.40,516.86,EUR,0.94
7,8,3398033,1,2024-04-20,2024-04-20,635184,160,991,3,268.00,235.84,88.79,EUR,0.94
8,9,3398033,0,2024-04-20,2024-04-20,635184,160,1681,7,6.89,5.93,3.17,EUR,0.94
9,10,3398032,1,2024-04-20,2024-04-25,852158,999999,1651,2,159.99,139.19,73.57,EUR,0.94

#### Assign Daily Order Numbers With PARTITION BY

1. Assign a row number to each row in the sales table, partitioned by date.
   - Use `ROW_NUMBER()` with `PARTITION BY orderdate` and `ORDER BY orderdate, orderkey, linenumber`.
      - ‚úÖ This will assign numbers that restart each day, ordered by order ID and line number.
   - Provides meaningful sequence of orders within each day.
   - WHERE clause included to show orders from the next day, demonstrating how numbering restarts.

In [8]:
%%sql

SELECT
    ROW_NUMBER() OVER(
        PARTITION BY
            orderdate
        ORDER BY 
            orderdate,
            orderkey,
            linenumber
    ) AS daily_order_num,
    *
FROM sales
WHERE orderdate > '2015-01-01'  -- WHERE included only to demonstrate numbering restarts every day
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,daily_order_num,orderkey,linenumber,orderdate,deliverydate,customerkey,storekey,productkey,quantity,unitprice,netprice,unitcost,currencycode,exchangerate
0,1,2000,0,2015-01-02,2015-01-02,1639738,530,1613,5,65.99,59.39,33.65,USD,1.00
1,2,2001,0,2015-01-02,2015-01-15,2085372,999999,2182,2,1237.50,1237.50,410.01,USD,1.00
2,3,2002,0,2015-01-02,2015-01-02,1732602,510,1822,2,22.40,22.40,11.42,USD,1.00
3,4,2002,1,2015-01-02,2015-01-02,1732602,510,49,5,149.96,149.96,68.96,USD,1.00
4,5,2003,0,2015-01-02,2015-01-02,728917,300,1674,2,4.89,4.89,2.49,EUR,0.83
5,6,2003,1,2015-01-02,2015-01-02,728917,300,369,1,1747.50,1555.28,803.60,EUR,0.83
6,7,2004,0,2015-01-02,2015-01-02,1724183,570,1654,2,155.99,155.99,51.68,USD,1.00
7,8,2005,0,2015-01-02,2015-01-02,2054699,480,460,1,749.75,712.26,382.25,USD,1.00
8,1,3000,0,2015-01-03,2015-01-03,1793739,500,108,3,99.74,97.75,45.87,USD,1.00
9,2,3000,1,2015-01-03,2015-01-03,1793739,500,1684,3,11.82,11.00,3.92,USD,1.00

#### Rank Customers Order Quantity

**`ROW_NUMBER`**

1. By customer, assign a rank to the total orders each customer made.  
   - Use `COUNT(orderkey)` to calculate the total number of orders for each customer.  
   - Group by `customerkey` to ensure the order count is calculated for each individual customer.  
   - Use `ROW_NUMBER() OVER (ORDER BY COUNT(orderkey) DESC)` to assign a unique rank to each customer based on their total orders, in descending order.  
   - Select `customerkey`, `total_orders`, and the rank (`row_number_rank`) in the output.

In [9]:
%%sql
SELECT 
    customerkey,
    COUNT(orderkey) AS total_orders,
    ROW_NUMBER() OVER (ORDER BY COUNT(orderkey) DESC) AS total_orders_row_num
FROM sales
GROUP BY customerkey
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey  total_orders  total_orders_row_num
0      1834524            31                     1
1      1375597            30                     2
2       249557            27                     3
3      1495941            26                     4
4       459519            26                     5
5      1801215            26                     6
6      1219056            25                     7
7      1876222            24                     8
8      1427444            24                     9
9       759419            24                    10

#### Monthly Ranking of Orders by Cohort

**`ROW_NUMBER`**

1. Get the `cohort_year` for each customer.  
   - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
   - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually.

In [10]:
%%sql 

SELECT 
    customerkey,
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year
FROM sales
GROUP BY 
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey cohort_year
0          2044589        2018
1          1603477        2021
2           876049        2017
3          1469222        2024
4          2089398        2018
...            ...         ...
49482       853617        2019
49483      1573639        2016
49484      1355936        2022
49485       967453        2024
49486        34354        2022

[49487 rows x 2 columns]

2. Create a CTE `cohort` to calculate the cohort year for each customer and then in the main query LEFT JOIN `cohort` on `customerkey` to the `sales` table to get the `orderdate` and `orderkey`.
   - üîî Define a CTE `cohort` to calculate the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
        - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually. 
   - üîî Main query joins this cohort information back to `sales` data using `LEFT JOIN`.
        - Gets the `customerkey`, `orderdate`, and `orderkey` from the `sales` table. 
        - Returns the `cohort_year` from the `cohort` CTE.

In [11]:
%%sql

WITH cohort AS (
	SELECT 
	    customerkey,
	    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year
	FROM sales
	GROUP BY 
	    customerkey
	)

-- Added 	
SELECT 
    s.customerkey,
    c.cohort_year,
    s.orderdate,
    s.orderkey
FROM sales s
LEFT JOIN cohort c ON c.customerkey = s.customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

        customerkey cohort_year   orderdate  orderkey
0            947009        2015  2015-01-01      1000
1            947009        2015  2015-01-01      1000
2           1772036        2015  2015-01-01      1001
3           1518349        2015  2015-01-01      1002
4           1518349        2015  2015-01-01      1002
...             ...         ...         ...       ...
199868       664396        2024  2024-04-20   3398034
199869       664396        2024  2024-04-20   3398034
199870       267690        2019  2024-04-20   3398035
199871       267690        2019  2024-04-20   3398035
199872       267690        2019  2024-04-20   3398035

[199873 rows x 4 columns]

3. Get the `cohort_year`, `order_month`, total orders, and the users in the cohort.  
    - Define a CTE `cohort` to calculate the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
        - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually. 
   - üîî Move the previous main query into a subquery to calculate the `cohort_year` for each customer and other sales data.  
        - In the subquery it joins the cohort information from `cohort` CTE back to `sales` data using `LEFT JOIN`.
        - Gets the `customerkey`, `orderdate`, and `orderkey` from the `sales` table. 
        - Returns the `cohort_year` from the `cohort` CTE.
   - üîî In the main query, use `DATE_TRUNC('month', orderdate)` to group orders by month.  
        - Calculate the total number of unique orders using `COUNT(DISTINCT orderkey)`.  
        - Calculate the total number of unique customers in the cohort using `COUNT(DISTINCT customerkey)`.  
        - Group the results by `cohort_year` and `order_month` to summarize the data at the cohort and monthly level.

In [12]:
%%sql

WITH cohort AS (
	SELECT 
	    customerkey,
	    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year
	FROM sales
	GROUP BY 
	    customerkey
	)

SELECT
    cohort_year,
    DATE_TRUNC('month',orderdate) AS order_month,
    COUNT(DISTINCT orderkey) AS total_orders,
    COUNT(DISTINCT customerkey) AS user_count
FROM (
    -- Put query into subquery
    SELECT 
        s.customerkey,
        c.cohort_year,
        s.orderdate,
        s.orderkey
    FROM sales s
    LEFT JOIN cohort c ON c.customerkey = s.customerkey
) cohort_analysis
GROUP BY 
    cohort_year, 
    order_month

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

580 rows affected.

    cohort_year                order_month  total_orders  user_count
0          2015  2015-01-01 00:00:00-08:00           200         200
1          2015  2015-02-01 00:00:00-08:00           292         291
2          2015  2015-03-01 00:00:00-08:00           139         139
3          2015  2015-04-01 00:00:00-07:00            78          78
4          2015  2015-05-01 00:00:00-07:00           236         236
..          ...                        ...           ...         ...
575        2023  2024-04-01 00:00:00-07:00            28          28
576        2024  2024-01-01 00:00:00-08:00           445         442
577        2024  2024-02-01 00:00:00-08:00           612         604
578        2024  2024-03-01 00:00:00-08:00           311         308
579        2024  2024-04-01 00:00:00-07:00            79          79

[580 rows x 4 columns]

4. Put the main query into another CTE and, in the main query, get the `cohort_year`, `order_month`, total orders, and user count. 
   - Define a CTE `cohort` to calculate the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
        - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually.  
   - üîî Define a CTE `cohort_totals` to calculate the total orders and user count by cohort year and order month.  
        - In the CTE, use `DATE_TRUNC('month', orderdate)` to group orders by month.  
        - Calculate total orders with `COUNT(orderkey)` and the total number of unique users with `COUNT(DISTINCT customerkey)`.  
        - Group the CTE by `cohort_year` and `order_month` to summarize the data at the cohort and monthly level.  
        - In the subquery it calculates the `cohort_year` for each customer and other sales data.  
          - Gets the `customerkey`, `orderdate`, and `orderkey` from the `sales` table. 
          - Returns the `cohort_year` from the `cohort` CTE.
   - üîî In the main query, select `cohort_year`, `order_month`, `total_orders`, and `user_count` from the CTE `cohort_totals`.

In [13]:
%%sql

WITH cohort AS (
	SELECT 
	    customerkey,
	    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year
	FROM sales
	GROUP BY 
	    customerkey
	),
    
-- Put previous query into a CTE
cohort_totals AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month',orderdate) AS order_month,
        COUNT(DISTINCT orderkey) AS total_orders,
        COUNT(DISTINCT customerkey) AS user_count
    FROM (
        -- Put query into subquery
        SELECT 
            s.customerkey,
            c.cohort_year,
            s.orderdate,
            s.orderkey
        FROM sales s
        LEFT JOIN cohort c ON c.customerkey = s.customerkey
    ) cohort_analysis
    GROUP BY 
        cohort_year, 
        order_month
)

-- Main query
SELECT
    cohort_year,
    order_month,
    total_orders,
    user_count
FROM cohort_totals;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

580 rows affected.

    cohort_year                order_month  total_orders  user_count
0          2015  2015-01-01 00:00:00-08:00           200         200
1          2015  2015-02-01 00:00:00-08:00           292         291
2          2015  2015-03-01 00:00:00-08:00           139         139
3          2015  2015-04-01 00:00:00-07:00            78          78
4          2015  2015-05-01 00:00:00-07:00           236         236
..          ...                        ...           ...         ...
575        2023  2024-04-01 00:00:00-07:00            28          28
576        2024  2024-01-01 00:00:00-08:00           445         442
577        2024  2024-02-01 00:00:00-08:00           612         604
578        2024  2024-03-01 00:00:00-08:00           311         308
579        2024  2024-04-01 00:00:00-07:00            79          79

[580 rows x 4 columns]

5. Assign a row number and order by the total orders to get the cohorts with the largest orders by order month.  
   - Define a CTE `cohort` to calculate the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
        - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually.  
   - Define a CTE `cohort_totals` to calculate the total orders and user count by cohort year and order month.  
        - In the CTE, use `DATE_TRUNC('month', orderdate)` to group orders by month.  
        - Calculate total orders with `COUNT(orderkey)` and the total number of unique users with `COUNT(DISTINCT customerkey)`.  
        - Group the CTE by `cohort_year` and `order_month` to summarize the data at the cohort and monthly level.  
        - In the subquery it calculates the `cohort_year` for each customer and other sales data.  
          - Gets the `customerkey`, `orderdate`, and `orderkey` from the `sales` table. 
          - Returns the `cohort_year` from the `cohort` CTE.
   - In the main query:
        - üîî Assign a rank to each cohort-month combination using `ROW_NUMBER() OVER (ORDER BY total_orders DESC)`.  
        - Select `cohort_year`, `order_month`, `total_orders`, `user_count`, and `row_number_rank` to output ranked results based on total orders.

In [14]:
%%sql

WITH cohort AS (
	SELECT 
	    customerkey,
	    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year
	FROM sales
	GROUP BY 
	    customerkey
	),
    

cohort_totals AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month',orderdate) AS order_month,
        COUNT(DISTINCT orderkey) AS total_orders,
        COUNT(DISTINCT customerkey) AS user_count
    FROM (
        SELECT 
            s.customerkey,
            c.cohort_year,
            s.orderdate,
            s.orderkey
        FROM sales s
        LEFT JOIN cohort c ON c.customerkey = s.customerkey
    ) cohort_analysis
    GROUP BY 
        cohort_year, 
        order_month
)

SELECT
    cohort_year,
    order_month,
    total_orders,
    user_count,
    ROW_NUMBER() OVER (ORDER BY total_orders DESC) AS row_number_rank -- Added
FROM cohort_totals;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

580 rows affected.

,cohort_year,order_month,total_orders,user_count,row_number_rank
0,2022,2022-12-01 00:00:00-08:00,1083,1066,1
1,2019,2019-02-01 00:00:00-08:00,1019,1003,2
2,2018,2018-12-01 00:00:00-08:00,998,991,3
3,2022,2022-02-01 00:00:00-08:00,991,985,4
4,2022,2022-06-01 00:00:00-07:00,969,952,5
...,...,...,...,...,...
575,2015,2020-11-01 00:00:00-07:00,5,5,576
576,2016,2020-10-01 00:00:00-07:00,4,4,577
577,2015,2017-04-01 00:00:00-07:00,4,4,578
578,2015,2020-09-01 00:00:00-07:00,2,2,579
579,2015,2016-04-01 00:00:00-07:00,1,1,580

<img src="../Resources/images/3.3_monthly_orders_cohort.png" alt="Cohort Monthly Orders" width="50%">

> ‚ö†Ô∏è **Chart Note**: This plots only for 2023 Cohort.

---
## RANK

### üìù¬†Notes

`RANK`

- **RANK**: Assigns the same rank to rows with identical values but skips ranks after ties (e.g., 1, 2, 2, 4).
- Syntax:
    ```sql
    RANK() OVER(
         PARTITION BY partition_expression
         ORDER BY column_name
    ) AS window_column_alias
    ```

### üîë Key Concepts
- **üìä Business Terms**: 
  - Customer Order Ranking: Position of a customer based on their order volume or value
  - Tied Rankings: When multiple customers share the same rank due to identical metrics
  - Order Volume: Total number of orders placed by a customer
- **üí° Why It Matters**: Identifies high-volume customers while preserving tied rankings
- **üéØ Common Use Cases**: Customer segmentation, identifying top customers
- **üìà Related KPIs**: Customer order volume, tier distribution

### üìà Analysis

- Rank customers by their total amount of orders.
- Track customer ordering behavior over time, grouping by the year of first purchase (cohort year) and aggregating orders and unique users by month.

#### Rank Customers Order Quantity

**`RANK`**

1. By customer, assign a rank to the total orders each customer made (from the previous example use `RANK` instead).  
   - Use `COUNT(orderkey)` to calculate the total number of orders for each customer.  
   - Group by `customerkey` to ensure the order count is calculated for each individual customer.  
   - üîî Use `RANK() OVER (ORDER BY COUNT(orderkey) DESC)` to assign a unique rank to each customer based on their total orders, in descending order.  
   - Select `customerkey`, `total_orders`, and the rank (`rank_rank`) in the output.

In [69]:
%%sql
SELECT 
    customerkey,
    COUNT(orderkey) AS total_orders,
    ROW_NUMBER() OVER (ORDER BY COUNT(orderkey) DESC) AS total_orders_row_num,
    RANK() OVER (ORDER BY COUNT(orderkey) DESC) AS total_orders_rank
FROM sales
GROUP BY customerkey
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey  total_orders  total_orders_row_num  total_orders_rank
0      1834524            31                     1                  1
1      1375597            30                     2                  2
2       249557            27                     3                  3
3      1495941            26                     4                  4
4       459519            26                     5                  4
5      1801215            26                     6                  4
6      1219056            25                     7                  7
7      1876222            24                     8                  8
8      1427444            24                     9                  8
9       759419            24                    10                  8

 > **NOTE:** With RANK(), customers with the same total_orders get the same rank (e.g., three customers with 26 orders all get rank 4), while ROW_NUMBER() assigns unique sequential numbers even for ties (4,5,6). RANK() shows true ties, while ROW_NUMBER() forces unique ordering.

#### Monthly Ranking of Orders by Cohort

**`RANK`**

1. Use the same query as before but use `RANK` to assign a rank to the cohort's total orders.
   - Define a CTE `cohort` to calculate the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
        - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually.  
   - Define a CTE `cohort_totals` to calculate the total orders and user count by cohort year and order month.  
        - In the CTE, use `DATE_TRUNC('month', orderdate)` to group orders by month.  
        - Calculate total orders with `COUNT(orderkey)` and the total number of unique users with `COUNT(DISTINCT customerkey)`.  
        - Group the CTE by `cohort_year` and `order_month` to summarize the data at the cohort and monthly level.  
        - In the subquery it calculates the `cohort_year` for each customer and other sales data.  
          - Gets the `customerkey`, `orderdate`, and `orderkey` from the `sales` table. 
          - Returns the `cohort_year` from the `cohort` CTE. 
   - In the main query: 
        - üîî Assign a rank to each cohort-month combination using `RANK() OVER (ORDER BY total_orders DESC)`.  
        - Select `cohort_year`, `order_month`, `total_orders`, `user_count`, and `rank_rank` to output ranked results based on total orders.

In [16]:
%%sql

WITH cohort AS (
	SELECT 
	    customerkey,
	    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year
	FROM sales
	GROUP BY 
	    customerkey
	),
    

cohort_totals AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month',orderdate) AS order_month,
        COUNT(DISTINCT orderkey) AS total_orders,
        COUNT(DISTINCT customerkey) AS user_count
    FROM (
        SELECT 
            s.customerkey,
            c.cohort_year,
            s.orderdate,
            s.orderkey
        FROM sales s
        LEFT JOIN cohort c ON c.customerkey = s.customerkey
    ) cohort_analysis
    GROUP BY 
        cohort_year, 
        order_month
)

SELECT
    cohort_year,
    order_month,
    total_orders,
    user_count,
    RANK() OVER (ORDER BY total_orders DESC) AS rank_rank -- Updated
FROM cohort_totals;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

580 rows affected.

,cohort_year,order_month,total_orders,user_count,rank_rank
0,2022,2022-12-01 00:00:00-08:00,1083,1066,1
1,2019,2019-02-01 00:00:00-08:00,1019,1003,2
2,2018,2018-12-01 00:00:00-08:00,998,991,3
3,2022,2022-02-01 00:00:00-08:00,991,985,4
4,2022,2022-06-01 00:00:00-07:00,969,952,5
...,...,...,...,...,...
575,2015,2020-11-01 00:00:00-07:00,5,5,575
576,2016,2020-10-01 00:00:00-07:00,4,4,577
577,2015,2017-04-01 00:00:00-07:00,4,4,577
578,2015,2020-09-01 00:00:00-07:00,2,2,579
579,2015,2016-04-01 00:00:00-07:00,1,1,580

---
## DENSE RANK

### üìù¬†Notes

`DENSE_RANK`

- **DENSE_RANK**: Similar to RANK(), it assigns the same rank to rows with identical values but does not skip ranks after ties (e.g., 1, 2, 2, 3).
- Syntax:
    ```sql
    DENSE_RANK() OVER(
         PARTITION BY partition_expression
         ORDER BY column_name
    ) AS window_column_alias
    ```

### üîë Key Concepts
- **üìä Business Terms**: 
  - Continuous Customer Ranking: Ranking system without gaps, even when ties exist
  - Order Volume Tiers: Groupings of customers based on their order quantities
  - Customer Segmentation: Process of dividing customers into groups based on similar characteristics
- **üí° Why It Matters**: Creates consecutive rankings for customer segmentation without gaps
- **üéØ Common Use Cases**: Customer tiering, continuous rank analysis
- **üìà Related KPIs**: Customer tier metrics, order volume distribution

### üìà Analysis

- Rank customers by their total amount of orders.
- Track customer ordering behavior over time, grouping by the year of first purchase (cohort year) and aggregating orders and unique users by month.

#### Rank Customers Order Quantity

**`DENSE_RANK`**

1. By customer, assign a rank to the total orders each customer made (from the previous example use `DENSE_RANK` instead).  
   - Use `COUNT(orderkey)` to calculate the total number of orders for each customer.  
   - Group by `customerkey` to ensure the order count is calculated for each individual customer.  
   - üîî Use `DENSE_RANK() OVER (ORDER BY COUNT(orderkey) DESC)` to assign a unique rank to each customer based on their total orders, in descending order.  
   - Select `customerkey`, `total_orders`, and the rank (`dense_rank`) in the output.

In [73]:
%%sql

SELECT 
    customerkey,
    COUNT(orderkey) AS total_orders,
    ROW_NUMBER() OVER (ORDER BY COUNT(orderkey) DESC) AS total_orders_row_num,
    RANK() OVER (ORDER BY COUNT(orderkey) DESC) AS total_orders_rank,
    DENSE_RANK() OVER (ORDER BY COUNT(orderkey) DESC) AS total_orders_dense_rank
FROM sales
GROUP BY customerkey
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,customerkey,total_orders,total_orders_row_num,total_orders_rank,total_orders_dense_rank
0,1834524,31,1,1,1
1,1375597,30,2,2,2
2,249557,27,3,3,3
3,1495941,26,4,4,4
4,459519,26,5,4,4
5,1801215,26,6,4,4
6,1219056,25,7,7,5
7,1876222,24,8,8,6
8,1427444,24,9,8,6
9,759419,24,10,8,6

> **NOTE:** DENSE_RANK differs from RANK in that it assigns consecutive ranks without gaps when there are ties, while RANK leaves gaps after ties.

#### Monthly Ranking of Orders by Cohort

**`DENSE_RANK`**

1. Use the same query as before but use `DENSE_RANK` to assign a rank to the cohort's total orders.
   - Define a CTE `cohort` to calculate the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
        - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually.  
   - Define a CTE `cohort_totals` to calculate the total orders and user count by cohort year and order month.  
        - In the CTE, use `DATE_TRUNC('month', orderdate)` to group orders by month.  
        - Calculate total orders with `COUNT(orderkey)` and the total number of unique users with `COUNT(DISTINCT customerkey)`.  
        - Group the CTE by `cohort_year` and `order_month` to summarize the data at the cohort and monthly level.  
        - In the subquery it calculates the `cohort_year` for each customer and other sales data.  
          - Gets the `customerkey`, `orderdate`, and `orderkey` from the `sales` table. 
          - Returns the `cohort_year` from the `cohort` CTE.
   - In the main query
        - üîî Assign a rank to each cohort-month combination using `DENSE_RANK() OVER (ORDER BY total_orders DESC)`.  
        - Select `cohort_year`, `order_month`, `total_orders`, `user_count`, and `dense_rank` to output ranked results based on total orders.

In [15]:
%%sql

WITH cohort AS (
	SELECT 
	    customerkey,
	    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year
	FROM sales
	GROUP BY 
	    customerkey
	),
    

cohort_totals AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month',orderdate) AS order_month,
        COUNT(DISTINCT orderkey) AS total_orders,
        COUNT(DISTINCT customerkey) AS user_count
    FROM (
        SELECT 
            s.customerkey,
            c.cohort_year,
            s.orderdate,
            s.orderkey
        FROM sales s
        LEFT JOIN cohort c ON c.customerkey = s.customerkey
    ) cohort_analysis
    GROUP BY 
        cohort_year, 
        order_month
)

SELECT
    cohort_year,
    order_month,
    total_orders,
    user_count,
    DENSE_RANK() OVER (ORDER BY total_orders DESC) AS dense_rank -- Updated 
FROM cohort_totals;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

580 rows affected.

,cohort_year,order_month,total_orders,user_count,dense_rank
0,2022,2022-12-01 00:00:00-08:00,1083,1066,1
1,2019,2019-02-01 00:00:00-08:00,1019,1003,2
2,2018,2018-12-01 00:00:00-08:00,998,991,3
3,2022,2022-02-01 00:00:00-08:00,991,985,4
4,2022,2022-06-01 00:00:00-07:00,969,952,5
...,...,...,...,...,...
575,2015,2020-11-01 00:00:00-07:00,5,5,249
576,2016,2020-10-01 00:00:00-07:00,4,4,250
577,2015,2017-04-01 00:00:00-07:00,4,4,250
578,2015,2020-09-01 00:00:00-07:00,2,2,251
579,2015,2016-04-01 00:00:00-07:00,1,1,252

### üí° What's the difference between `ROW_NUMBER()`, `RANK()`, `DENSE_RANK()`

1. `ROW_NUMBER()` 
    - Even if two rows have the same value, they will get different, consecutive ranks.
    - Example: If three products have the same sales amount, they‚Äôll be ranked 1, 2, and 3 in sequence.

| Sales | ROW_NUMBER() |
|-------|--------------|
| 500   | 1            |
| 500   | 2            |
| 400   | 3            |
| 300   | 4            |  
  

2. `RANK()`
    - Rows with identical values receive the same rank, and the next rank jumps to the next number in sequence.
    - Example: If three products have the same highest sales amount, they all get rank 1, and the next product will get rank 4.

| Sales | ROW_NUMBER() |
|-------|--------------|
| 500   | 1            |
| 500   | 1            |
| 400   | 3            |
| 300   | 4            |


3. `DENSE_RANK()`
    - Rows with identical values receive the same rank, and the next rank continues sequentially without gaps.
    - Example: If three products have the same highest sales amount, they all get rank 1, and the next product will get rank 2.

| Sales | ROW_NUMBER() |
|-------|--------------|
| 500   | 1            |
| 500   | 1            |
| 400   | 2            |
| 300   | 3            |

**Alternative note format**

- Same info as above but in a different format. 

| Function     | Description                                                                                    | Tie Handling                           | Example Sales Values (500, 500, 400, 300) |
|--------------|------------------------------------------------------------------------------------------------|----------------------------------------|-------------------------------------------------------|
| ROW_NUMBER() | Assigns a unique, sequential rank   to each row without regard for ties.                       | No ties; each row gets a unique   rank | 1, 2, 3, 4                                            |
| RANK()       | Assigns the same rank to   identical values but skips ranks after ties.                        | Same rank for ties; skips next   ranks | 1, 1, 3, 4                                            |
| DENSE_RANK() | Assigns the same rank to   identical values but continues sequentially without skipping ranks. | Same rank for ties; no skipped   ranks | 1, 1, 2, 3                                            |

Using our simple example before of getting the total orders per customer.

In [35]:
%%sql
SELECT 
    customerkey,
    COUNT(DISTINCT orderkey) AS total_orders,
    ROW_NUMBER() OVER (ORDER BY COUNT(orderkey) DESC) AS row_number_rank,
    RANK() OVER (ORDER BY COUNT(orderkey) DESC) AS rank_rank,
    DENSE_RANK() OVER (ORDER BY COUNT(orderkey) DESC) AS dense_rank_rank
FROM sales
GROUP BY customerkey;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey  total_orders  row_number_rank  rank_rank  dense_rank_rank
0          1834524             8                1          1                1
1          1375597             7                2          2                2
2           249557             9                3          3                3
3          1495941             7                4          4                4
4           459519             6                5          4                4
...            ...           ...              ...        ...              ...
49482      1407634             1            49483      39985               28
49483         1381             1            49484      39985               28
49484      1407353             1            49485      39985               28
49485      1747703             1            49486      39985               28
49486      1747714             1            49487      39985               28

[49487 rows x 5 columns]